ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/UC5_UART_1.0.xml
    <register id="UC5_UART_LINC1" width="32" offset="0x113C" description="UART LIN Mode Capture 1 Register">
        <bitfield id="DATA" description="16 Bit Capture / Compare Register 
Captures current LINCTR value on RXD rising edge and can generate a LINC1 interrupt when capture is enabled (LINC1CAP = 1)" begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC5_UART_IRCTL" width="32" offset="0x1140" description="eUSCI_Ax IrDA Control Word Register">
        <bitfield id="IRTXPL" description="Transmit pulse length.
Pulse length t(PULSE) = (IRTXPLx + 1) / [2 * f(IRTXCLK)]
(IRTXCLK = functional clock of the UART)" begin="7" end="2" width="6" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3F" description="Highest possible value"/>
        </bitfield>
        <bitfield id="IRRXPL" description="IrDA receive input UCAxRXD polarity" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="HIGH" value="0x0" description="IrDA transceiver delivers a high pulse when a light pulse is seen"/>
            <bitenum id="LOW" value="0x1" description="IrDA transceiver delivers a low pulse when a light pulse is seen"/>
        </bitfield>
        <bitfield id="IREN" description="IrDA encoder/decoder enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="IrDA encoder/decoder disabled"/>
            <bitenum id="ENABLE" value="0x1" description="IrDA encoder/decoder enabled"/>
        </bitfield>
        <bitfield id="IRTXCLK" description="IrDA transmit pulse clock select" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="BITCLK" value="0x0" description="IrDA encode data is based on the functional clock."/>
            <bitenum id="BRCLK" value="0x1" description="IrDA encode data is based on the Baud Rate clock&lt;
when select 8x oversampling, the IRTXPL cycle should less 8; 
when select 16x oversampling, the IRTXPL cycle should less 16."/>
        </bitfield>
    </register>
    <register id="UC5_UART_AMASK" width="32" offset="0x1148" description="Self Address Mask Register">
        <bitfield id="MSK" description="Self Address Mask for 9-Bit Mode  This field contains the address mask that creates a set of addresses that should be matched.  A 0 bit in the MSK bitfield configures, that the corresponding bit in the ADDR bitfield of the UARTxADDR register is don't care. A 1 bit in the MSK bitfield configures, that the corresponding bit in the ADDR bitfield of the UARTxADDR register must match." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC5_UART_ADDR" width="32" offset="0x114C" description="Self Address Register">
        <bitfield id="ADDR" description="Self Address for 9-Bit Mode  This field contains the address that should be matched when UARTxAMASK is FFh." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>

</module>